Revit 2027 API
ParameterSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ParameterSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As ParameterSetIterator
public:
virtual ParameterSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ParameterSetIterator
override ForwardIterator : unit -> ParameterSetIterator
Return Value
ParameterSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
ParameterSet Class
Autodesk.Revit.DB Namespace